windtunnel/templates/system/forceCoeffs.jinja
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forceCoeffs1
{
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (objectGroup);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1;           // Redundant for incompressible
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (1 0 0);  // Axle midpoint on ground
    pitchAxis       (0 1 0);
    magUInf         {{ wind_speed }};
    lRef            {{ length }};        // Wheelbase length
    Aref            {{ area }};        // Estimated
}


// ************************************************************************* //
